Revit 2017 API
StructuralSectionsServiceData Members
The StructuralSectionsServiceData type exposes the following members.
Constructors
Name | Description
StructuralSectionsServiceData
 Constructs a new instance of SectionTypeParameterServiceData.
Methods
Name | Description
Dispose
Releases all resources used by the StructuralSectionsServiceData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCurrentElements
 Returns the list of Ids of the current elements.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Document
 The current document.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
StructuralSectionsServiceData Class
Autodesk.Revit.DB.Structure Namespace